{
  "info": {
    "page": 1,
    "pages": 11836,
    "results": 59179
  },
  "plugins": [
    {
      "name": "SysBasics Customize My Account for WooCommerce",
      "slug": "customize-my-account-for-woocommerce",
      "version": "2.11.1",
      "author": "<a href=\"https://sysbasics.com\">SysBasics</a>",
      "author_profile": "https://profiles.wordpress.org/phppoet/",
      "requires": "3.3",
      "tested": "6.7.1",
      "requires_php": "5.2",
      "requires_plugins": [],
      "rating": 84,
      "ratings": {
        "5": 15,
        "4": 0,
        "3": 1,
        "2": 1,
        "1": 3
      },
      "num_ratings": 20,
      "support_threads": 1,
      "support_threads_resolved": 0,
      "active_installs": 10000,
      "downloaded": 360072,
      "last_updated": "2025-01-19 1:15am GMT",
      "added": "2021-03-11",
      "homepage": "https://sysbasics.com",
      "short_description": "Manage/customize WooCommerce My Account Page along with endpoints, user avatar , account/registration fields and much more",
      "description": "<h3>Customize My Account for WooCommerce</h3>\n<p>SysBasics Customize My Account for WooCommerce Plugin add dashboard links , user avatar, manage My Account endpoints &amp; account/registration fields</p>\n<p><a href=\"https://sysbasics.com/go/customize/\" title=\"Customize My Account for WooCommerce pro\" rel=\"nofollow ugc\">Upgrade to pro</a></p>\n<p>Check <a href=\"https://sysbasics.com/go/customize-demo/\" title=\"Customize My Account for WooCommerce pro\" rel=\"nofollow ugc\">Live Demo</a> for Pro version features</p>\n<p>Customize My Account for WooCommerce</p>\n<p>Customize your default my account page. Reorder them , hide existing core endpoints. You will also be able to change the default endpoint.</p>\n<h3>Main Features of Customize My Account for WooCommerce plugin</h3>\n<ul>\n<li>Add new endpoints in the My Account page, visible to your users , and choose what the content will be using third party shortcodes. You can use third party<br />\nsubscription , royalty , coupons , wallet related shortcodes.</li>\n<li>Create Specific endpoints , links , groups into my account page that are visible only specific roles or users;</li>\n<li>Choose and customize the layout of the My Account page so to make it more usable and modern;</li>\n<li>Hide/show existing endpoitns without using any extra code. </li>\n<li>Add icons to your existings my account page endpoints. Optionally you can display them as dashboard links and most importantly show them inside<br />\nMy account widget. </li>\n<li>Compatible with WPML and WPML sticky links.</li>\n</ul>\n<h3>Modify the default WooCommerce endpoints</h3>\n<ul>\n<li>This is the most important feature of this plugin just after activation using checkboxes you exclude/include/rename existing endpoints. set icons to existing and new endpoint/links. Plugin support three types of library as of now for icons. Font Awesome, Dashicons and you can also upload your own icon.<br />\nPlugin also seamlessly integrates itself with third party endpoints. It recognises the existing endpoint. Best part is that you can even reorder/rename that<br />\nthird party endpoint. In certain cases if you want this plugin to take over third party endpoint, just hide the existing third party endpoint by unchecking<br />\nthe checkbox then create new endpoint with same slug and it will work fine. For example you have Rewards Endpoint that are sourced from any other plugin which has revwards slud. in that case if you want full control as other endpoints just hide existing endpoint and add new endpoint with rewards slug and it will just work fine. </li>\n</ul>\n<h3>Manage Custom fields on Edit My Account Page</h3>\n<p>-You can hide the existing fields on WooCommerce Edit account page as well as add new fields there, Plugin supports 15 new field type including file upload for that. YOu can collect data from user for this fields plus you can conditionally show/hide these fields based on various conditions.</p>\n<h3>Make your Dashboard Pretty with Dashboard links (Pro Feature)</h3>\n<p>-Plugin upon activation ads dashboard links or you may call it banner to your dashboard page. Most importantly you can manage the order of those dashboard links and you can also exclude certain endpoints from being included in dashboard links. Certain themes do have this feature inbuilt , in those case we<br />\nhave provided you option to disable this feature completely. It works on most possible scenarios with wider theme compatibility. This feature is part of pro version only.</p>\n<h3>My Account navigation widget menu</h3>\n<ul>\n<li>Plugin has inbuilt my account navigation widget menu feature where you can include existing endpoint links and display them into any menu of your site. Plugin also support navigation widget under appearance/menu field.</li>\n</ul>\n<h3>Allow WooCommerce users to change avatar</h3>\n<ul>\n<li>Pugin by default upon activation displays nice gravtar on my account page where optionally you can allow them to change the avatar by uploading png/jpg file. you can even adjust the dimension of avatar for users.  </li>\n</ul>\n<h3>Redirect default dashboard to endpoint (Pro Feature)</h3>\n<ul>\n<li>Using simple option you can replace default page from dashboard to orders , downloads or something else. you can even create custom endpoint and send users there upon login. This feature is useful specially if you don&#8217;t like the default dashboard. Using elementor you can create clone template of dashboard or other endpoint and replace that with new cloned template.  This feature is part of pro version only.</li>\n</ul>\n<h3>Make WooCommerce My Account Endpoints Ajax Powered (Pro Feature)</h3>\n<ul>\n<li>Using simple option you can make Entire my account endpoints content loaded via Ajax, This could improve end user feel about your site. It does work with custom groups and custom endpoints. Simply visit the settings tab and set yes for Enable Ajax navigation option and you will see smoother loading experience on frontend.Ajax navigation even works with dashboard links and internal my account page links like Edit shipping address and Edit billing address Check our pro version demo for this feature. This feature is part of pro version only.</li>\n</ul>\n<h3>Override endpoints using elementor</h3>\n<ul>\n<li>This plugin is even charm with free plugin elementor where you can create cloned template of existing endpoints and replace existing endpoints with cloned endpoints usind elementor&#8217;s drag and drop feature. </li>\n</ul>\n<h3>Change From your account dashboard text</h3>\n<ul>\n<li>WooCommerce displays &#8220;Change From your account dashboard text&#8221; at the begining of dashboard content after &#8220;Hello , username&#8221; text which could be very irritating for many. Using this plugin you can simply hide  &#8220;Hello , username&#8221; text plus you can hide entire intro text &#8220;From your account dashboard you can view your &#8230;&#8221; and you can also add new custom html or plan content just as a replacement of that text. Just visit the settings of dashboard endpoint and you should be able to find three toggle to enable or disable any. </li>\n</ul>\n<h3>Make WooCommerce My account menu horizontal (Pro Feature) </h3>\n<ul>\n<li>WooCommerce by default have vertical menu which is good for most case scenario but in certain cases where menu items are limited users can opt for horizontal menu. Just visit the settings tab and set yes for Enable horizontal menu. This feature is compatible with most of popular themes out there. This feature is part of pro version only.</li>\n</ul>\n<h3>ACF forms in WooCommerce My Account</h3>\n<ul>\n<li>Using third party plugin <a href=\"https://wordpress.org/plugins/acf-frontend-form-element/\" rel=\"ugc\">Frontend Admin by DynamiApps</a> You can create dynamic forms within your woocommerce my account page. possible use case scenario like having profile edit form inside endpoint, guest posting form , recipe submission form etc. Possibilities are endless with this.</li>\n</ul>\n<p> Customize My Account for WooCommerce Other features </p>\n<ul>\n<li>Modify existing endpoints.</li>\n<li>Add My Account navigation widget to any menu.</li>\n<li>Add custom links to your my account pages.</li>\n<li>Drag and drop UI.</li>\n<li>Modify WooCommerce My account Navigation background color</li>\n<li>Modify WooCommerce My account Navigation text color</li>\n<li>Modify WooCommerce My account menu item background color</li>\n<li>Easily Create new custom my account page using Customize My Account widgets for free elementor widgets. </li>\n</ul>\n<p> Customize My Account for WooCommerce free version features </p>\n<ul>\n<li>Show/hide woocommerce core endpoints</li>\n<li>Reorder core woocommerce my account endpoints</li>\n<li>Add extra class to core endpoint</li>\n<li>Add New link as endpoint on my account page</li>\n<li>Show user avatar on my account page</li>\n<li>Drag and drop UI</li>\n<li>Use Dashicons for WooCommerce My Account Endpoints. Plugin has inbuilt dashicon picker. If somehow font awesome icons not working for you , you can opt for dashicon which has wider compatibility across all themes.</li>\n<li>Optionally replace entire my account with custom elementor template.</li>\n<li>Optionally override endpoint content with elementor template content</li>\n</ul>\n<h3>Customize My Account for WooCommerce pro version features</h3>\n<ul>\n<li>All features of free version</li>\n<li>Support for link/endpoint/group endpoints</li>\n<li>Drage link/endpoints(core/new) into group and reorder them</li>\n<li>Show custom content on endpoints</li>\n<li>Set groups as show by default which will make group menu open on page load</li>\n<li>Hide existing order page columns</li>\n<li>Add new custom columns to order listing page</li>\n<li>Reorder order page columns</li>\n<li>Add new custom order actions button in action column</li>\n</ul>\n<h3>Privacy Policy</h3>\n<p>Customize My Account for WooCommerce uses <a href=\"https://Appsero.com\" rel=\"nofollow ugc\">Appsero</a> SDK to collect some telemetry data upon user&#8217;s confirmation. This helps us to troubleshoot problems faster &amp; make product improvements.</p>\n<p>Appsero SDK <strong>does not gather any data by default.</strong> The SDK only starts gathering basic telemetry data <strong>when a user allows it via the admin notice</strong>. We collect the data to ensure a great user experience for all our users.</p>\n<p>Integrating Appsero SDK <strong>DOES NOT IMMEDIATELY</strong> start gathering data, <strong>without confirmation from users in any case.</strong></p>\n<p>Learn more about how <a href=\"https://Appsero.com/privacy-policy/\" rel=\"nofollow ugc\">Appsero collects and uses this data</a>.</p>\n",
      "download_link": "https://downloads.wordpress.org/plugin/customize-my-account-for-woocommerce.2.11.1.zip",
      "tags": {
        "customize": "customize",
        "endpoints": "Endpoints",
        "my-account": "My account",
        "user-avatar": "user avatar",
        "woocommerce": "woocommerce"
      },
      "donate_link": "",
      "icons": {
        "1x": "https://ps.w.org/customize-my-account-for-woocommerce/assets/icon-128x128.png?rev=3180551"
      }
    },
    {
      "name": "Hotel Booking for WooCommerce",
      "slug": "hotel-booking-for-woocommerce",
      "version": "1.0.0",
      "author": "<a href=\"https://uptonines.com\">Uptonines</a>",
      "author_profile": "https://profiles.wordpress.org/uptonines/",
      "requires": "6.0",
      "tested": "6.7.2",
      "requires_php": "7.4",
      "requires_plugins": [
        "woocommerce"
      ],
      "rating": 0,
      "ratings": {
        "5": 0,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
      },
      "num_ratings": 0,
      "support_threads": 0,
      "support_threads_resolved": 0,
      "active_installs": 0,
      "downloaded": 0,
      "last_updated": "2025-01-19 12:52am GMT",
      "added": "2025-01-19",
      "homepage": "https://wordpress.org/plugins/hotel-booking-for-woocommerce",
      "short_description": "Adds a reservation system for a hotel, B&amp;B, villa, apartments, hostel, or any similar accommodation into your WooCommerce website easily!",
      "description": "<p>Looking to add a professional hotel booking system to your WooCommerce website? The <strong>Hotel Booking for WooCommerce</strong> plugin is the perfect solution for easily managing bookings at your hotel, B&amp;B, villa, apartment, hostel, or any similar accommodation. If you&#8217;re already comfortable with WooCommerce, this plugin will seamlessly integrate into your site, allowing you to manage your accommodations like a pro.</p>\n<p><strong>Start with the free version</strong> and unlock a range of essential features. You can create custom rate plans for your accommodation, set room allotments to prevent overbooking, and apply minimum stay rules for each room. The plugin also lets you offer a simple yet effective availability check, where customers can search for rooms based on their desired check-in and check-out dates and the number of guests. This enables direct bookings based on real-time availability, making the booking process smooth and hassle-free. You can even place the availability search form on any page via shortcode, and customize the room amenities with icons or custom SVGs for a unique touch.</p>\n<p>The free version also offers flexible payment options by supporting any payment gateway available through WooCommerce. Additionally, you can set custom prices for specific dates within the default rate plan, and quickly make bulk edits to rate plans and availability. While the free version offers plenty of features to get started, upgrading to the Pro version will unlock even more advanced tools.</p>\n<p>With the Pro version, you can set custom prices and open/close rates for all rate plans, not just the default one. Bulk editing is expanded to include all rate plans, giving you the flexibility to manage your pricing strategy more effectively and save time on updates.</p>\n<p>Get started today with the free version, explore its powerful features, and when you&#8217;re ready to take your hotel booking system to the next level, upgrading to the Pro version will give you all the tools you need for a fully optimized booking experience. Download the plugin now and start managing your bookings with ease!</p>\n<h4>Features included in free version</h4>\n<ul>\n<li>Create any custom rate plans for your accommodation.</li>\n<li>Set allotment for each room to avoid any overbooking.</li>\n<li>Set minimum stays rule for each room.</li>\n<li><strong>Recommended</strong> exclude the accommodation from your shop page.</li>\n<li>Availability check, allow your customer to search available rooms based on the criteria (checkin, checkout &amp; guests) and make direct booking on the availability results page.</li>\n<li>Put the availability search form at any page via Shortcode.</li>\n<li><strong>Flexible payment gateway.</strong> Use any payment gateway supported by WooCommerce.</li>\n<li>Set custom price per date for <strong>default rate plan</strong>.</li>\n<li>Open/close rate per date for <strong>default rate plan</strong>.</li>\n<li>Bulk edit for default rate plan and availability.</li>\n<li>Room amenities with icon or custom svg.</li>\n</ul>\n<h4>Features included in PRO version</h4>\n<ul>\n<li>All features of the free version.</li>\n<li>Ability to set custom price per date for <strong>all rate plans</strong>.</li>\n<li>Open/close rate per date for <strong>all rate plans</strong>.</li>\n<li>Bulk edit for <strong>all rate plans</strong>.</li>\n</ul>\n",
      "download_link": "https://downloads.wordpress.org/plugin/hotel-booking-for-woocommerce.1.0.0.zip",
      "tags": {
        "accommodation": "accommodation",
        "book": "book",
        "booking": "booking",
        "ecommerce": "ecommerce",
        "hotel": "Hotel"
      },
      "donate_link": "",
      "icons": {
        "1x": "https://ps.w.org/hotel-booking-for-woocommerce/assets/icon-128x128.png?rev=3224964",
        "2x": "https://ps.w.org/hotel-booking-for-woocommerce/assets/icon-256x256.png?rev=3224964"
      }
    },
    {
      "name": "Auto Robot &#8211; WP Autoblogging and RSS Feed News Aggregator",
      "slug": "auto-robot",
      "version": "3.8.93",
      "author": "<a href=\"https://wpautorobot.com/pricing\">wphobby</a>",
      "author_profile": "https://profiles.wordpress.org/darell/",
      "requires": "4.0",
      "tested": "6.7.1",
      "requires_php": false,
      "requires_plugins": [],
      "rating": 36,
      "ratings": {
        "5": 2,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 8
      },
      "num_ratings": 10,
      "support_threads": 0,
      "support_threads_resolved": 0,
      "active_installs": 60,
      "downloaded": 148814,
      "last_updated": "2025-01-19 12:46am GMT",
      "added": "2020-05-27",
      "homepage": "http://wpautorobot.com/",
      "short_description": "Auto blogging and generate WordPress posts automatically from OpenAI ChatGPT, RSS Feed, Instagram, Youtube, Facebook, Twitter, Vimeo, Flickr and etc.",
      "description": "<p><a href=\"http://demo.wpautorobot.com/wp-admin/\" rel=\"nofollow ugc\"><strong>Try Premium Version Demo</strong></a></p>\n<p>Auto Robot is an auto blogging WordPress Plugin that make you can generate WordPress posts from as many article source, include <strong>OpenAI ChatGPT, RSS Feed, Social Media, Videos, Images, Sound and etc</strong>.<br />\nThis plugin comes with built in options that you can use to generate different posts as you needed.</p>\n<p>By using this Auto Robot plugin, you can scrape the best content from all around the web from multiple sources, and with the post template feature, you can also insert your ads code like adsense, which will make your website become a many money auto blogging website in seconds.</p>\n<h3>How to use it</h3>\n<p>One minute video tutorial and you are ready to use it, that’s how simple Auto Robot is!</p>\n<p><iframe loading=\"lazy\" title=\"Auto Robot RSS WordPress\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/eeuAVH5W2GM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></p>\n<h3>Presentation</h3>\n<p><a href=\"https://wpautorobot.com/pricing\" rel=\"nofollow ugc\">Premium Version</a> | <a href=\"https://wpautorobot.com/pricing\" rel=\"nofollow ugc\">Pro Features</a> | <a href=\"https://wpautorobot.com/pricing\" rel=\"nofollow ugc\">Documentation</a> | <a href=\"https://www.youtube.com/watch?v=eeuAVH5W2GM&amp;list=PLYbs7RFTMsuJabBUue48xlkHl_A3hoohP/\" rel=\"nofollow ugc\">Videos Guides</a></p>\n<h3>AUTO ROBOT – THE POWERFUL RSS AGGREGATOR AND CONTENT AGGREGATOR PLUGIN FOR AUTOBLOGGING</h3>\n<p><a href=\"https://wpautorobot.com/pricing\" rel=\"nofollow ugc\">Auto Robot</a> helps you aggregate unlimited RSS feeds and automatically publish them on your site within a few minutes.</p>\n<p>With <a href=\"https://wpautorobot.com/pricing\" rel=\"nofollow ugc\">Auto Robot</a>, you can sit back, let your site autoblog and always stay fresh with new content, which in return helps improve content marketing, boost your SEO, increase audience’s engagement, and probably earn more money.</p>\n<h3>WHAT YOU CAN DO WITH AUTO ROBOT:</h3>\n<ul>\n<li>Autoblogging with unlimited keywords and scraper campaigns</li>\n<li>No Duplicate Content. Advanced options to checks and verify the plugin will not post any duplicate content on your site</li>\n<li>Autoblogging with long tail keywords supported</li>\n<li>Keyword suggestions feature using google suggest api</li>\n<li>Use WP Cron Jobs schedule system to run all scraper campaigns on backend automatically</li>\n<li>Set post type include post, page, attachment and custom post types</li>\n<li>Set post status include publish, draft, private, pending</li>\n<li>Set post author for autoblogging system</li>\n<li>Insert custom content before and after post template</li>\n<li>Set the RSS campaigns generated post content words limit</li>\n<li>RSS Feed to post (our most loved feature): convert RSS feed items to WordPress pages, posts, and custom post type automatically</li>\n<li>Import and aggregate unlimited RSS feeds from unlimited sources automatically</li>\n<li>Bulk import and organize multiple feed sources of similar topics into Categories</li>\n<li>Easily display RSS feeds using shortcodes, Gutenberg blocks, or widgets in your third-party page builders like Elementor</li>\n<li>Import images with your RSS feeds or use your own image/logo for feeds without image</li>\n<li>Control number of items you want to display for a feed source. Just want to display 1 article or 20 articles in a block? You’ve got it with one click</li>\n<li>Choose your own caching time and how often you want to pull RSS feeds to ensure the best performance for your site</li>\n<li>Control which meta fields you want to display, such as author, date and time of the RSS feed</li>\n<li>Responsive content across platforms</li>\n</ul>\n<h3>YOU SHOULD USE AUTO ROBOT IF</h3>\n<ul>\n<li>You own a news site. You want a WP news aggregator to make sure your site always updated with the latest news</li>\n<li>You own a blog. You need a WP content aggregator to autoblog and keep your audience engaged with fresh content</li>\n<li>You want to improve your website SEO rankings.</li>\n<li>You develop a site for your client and just want to quickly demo a news feed of frequently updated content</li>\n<li>You build a company website and want a news/blog page to enhance company’s reputation and SEO. Focus on your business and leave the content marketing work to <a href=\"https://wpautorobot.com/pricing\" rel=\"nofollow ugc\">Auto Robot</a></li>\n<li>You run an affiliate business or want to earn extra from RSS affiliate marketing feeds</li>\n<li>You need a simple but comprehensive solution to curate anything in your niche, such as property listing for a real estate website, product listing for an affiliated e-commerce site, etc</li>\n<li>You want to earn more money, thanks to the benefits above</li>\n</ul>\n<h3>Premium Available Social Media Addons</h3>\n<blockquote><p>\n1. <a href=\"https://wpautorobot.com/pricing\" rel=\"nofollow ugc\">Youtube</a> – Auto generate posts from Youtube to WordPress by keywords, playlist, channel links.<a href=\"https://www.youtube.com/watch?v=eeuAVH5W2GM&amp;list=PLYbs7RFTMsuJabBUue48xlkHl_A3hoohP\" rel=\"nofollow ugc\">Check demo</a><br />\n2. <a href=\"https://wpautorobot.com/pricing\" rel=\"nofollow ugc\">Instagram</a> – Auto generate posts from Instagram to WordPress by keywords, user profile links. <a href=\"https://www.youtube.com/watch?v=eeuAVH5W2GM&amp;list=PLYbs7RFTMsuJabBUue48xlkHl_A3hoohP\" rel=\"nofollow ugc\">Check demo</a><br />\n3. <a href=\"https://wpautorobot.com/pricing\" rel=\"nofollow ugc\">Twitter</a> – Auto generate posts from Twitter to WordPress.<a href=\"https://www.youtube.com/watch?v=eeuAVH5W2GM&amp;list=PLYbs7RFTMsuJabBUue48xlkHl_A3hoohP\" rel=\"nofollow ugc\">Check demo</a><br />\n4. <a href=\"https://wpautorobot.com/pricing\" rel=\"nofollow ugc\">Facebook</a> – Auto generate posts from Facebook to WordPress by pages, groups and user profile links.<a href=\"https://www.youtube.com/watch?v=eeuAVH5W2GM&amp;list=PLYbs7RFTMsuJabBUue48xlkHl_A3hoohP\" rel=\"nofollow ugc\">Check demo</a><br />\n5. <a href=\"https://wpautorobot.com/pricing\" rel=\"nofollow ugc\">Vimeo</a> – Auto generate posts from Vimeo to WordPress by keywords.<a href=\"https://www.youtube.com/watch?v=eeuAVH5W2GM&amp;list=PLYbs7RFTMsuJabBUue48xlkHl_A3hoohP\" rel=\"nofollow ugc\">Check demo</a><br />\n6. <a href=\"https://wpautorobot.com/pricing\" rel=\"nofollow ugc\">Flickr</a> – Auto generate posts from Flickr to WordPress by keywords, user profile link. <a href=\"https://www.youtube.com/watch?v=eeuAVH5W2GM&amp;list=PLYbs7RFTMsuJabBUue48xlkHl_A3hoohP\" rel=\"nofollow ugc\">Check demo</a>\n</p></blockquote>\n<h3><strong>Premium Features:</strong></h3>\n<blockquote>\n<ul>\n<li>Autoblogging posts from OpenAI ChatGPT</li>\n<li>Autoblogging posts from Twitter</li>\n<li>Autoblogging posts from Facebook</li>\n<li>Autoblogging posts from Instagram by keywords, user profile</li>\n<li>Autoblogging videos from Youtube by keywords, playlist and channel</li>\n<li>Autoblogging videos from Vimeo by keywords, user profile link</li>\n<li>Autoblogging images from Flickr keywords, user profile link</li>\n<li>Set custom post template using shortcodes</li>\n<li>Set original images as post featured image</li>\n<li>Save original images to WordPress media library</li>\n<li>Detailed logs and reporting system</li>\n<li>Translate the original content using Google Translate API before publish post</li>\n</ul>\n</blockquote>\n<blockquote>\n<p><strong>Auto Robot Pro Version</strong></p>\n<p>Like Auto Robot Free Version? Here&#8217;s you can get <a href=\"https://wpautorobot.com/pricing\" rel=\"nofollow ugc\"> Auto Robot pro version</a> and have more features.</p>\n</blockquote>\n<h3>Do you like Auto Robot?</h3>\n<blockquote>\n<p>Don’t hesitate to <a href=\"https://wordpress.org/support/plugin/auto-robot/reviews/#new-post\" rel=\"ugc\">give your feedback</a>. It will help making the plugin better. Other contributions (such as new translations or helping other users on the support forum) are welcome !\n</p>\n</blockquote>\n<h3>Maybe you need</h3>\n<p><a href=\"https://wordpress.org/plugins/ultimate-db-manager-lite/\" rel=\"ugc\">Ultimate WP DB Manager – WordPress Database Backup, Cleanup &amp; Optimize</a></p>\n<p><a href=\"https://wordpress.org/plugins/elegant-calendar-lite/\" rel=\"ugc\">Elegant Calendar Lite – WordPress Events Calendar Plugin</a></p>\n<p><a href=\"https://wordpress.org/plugins/pretty-opt-in-lite/\" rel=\"ugc\">Pretty Opt In Lite – Content Locker for Lead Generation</a></p>\n<p><a href=\"https://wordpress.org/plugins/wphobby-addons-for-elementor/\" rel=\"ugc\">WPHobby Addons for Elementor</a></p>\n<p><a href=\"https://wordpress.org/plugins/wphobby-pdf-invoices-for-woocommerce/\" rel=\"ugc\">WooCommerce PDF Invoices Maker</a></p>\n",
      "download_link": "https://downloads.wordpress.org/plugin/auto-robot.zip",
      "tags": {
        "rss-post-importer": "rss post importer",
        "wordpress-aggregator-plugin": "wordpress aggregator plugin",
        "wordpress-news-feed-plugin": "wordpress news feed plugin",
        "wp-aggregator": "wp aggregator",
        "wp-rss-aggregator-feed-to-post": "wp rss aggregator feed to post"
      },
      "donate_link": "",
      "icons": {
        "1x": "https://ps.w.org/auto-robot/assets/icon-128x128.jpg?rev=2872723"
      }
    },
    {
      "name": "Advanced Access Manager &#8211; Restricted Content, Users &amp; Roles, Enhanced Security and More",
      "slug": "advanced-access-manager",
      "version": "6.9.45",
      "author": "<a href=\"https://aamportal.com\">AAM </a>",
      "author_profile": "https://profiles.wordpress.org/vasyltech/",
      "requires": "5.2.0",
      "tested": "6.7.1",
      "requires_php": "5.6.0",
      "requires_plugins": [],
      "rating": 84,
      "ratings": {
        "5": 309,
        "4": 22,
        "3": 14,
        "2": 8,
        "1": 67
      },
      "num_ratings": 420,
      "support_threads": 5,
      "support_threads_resolved": 0,
      "active_installs": 100000,
      "downloaded": 6344226,
      "last_updated": "2025-01-19 12:02am GMT",
      "added": "2011-07-30",
      "homepage": "",
      "short_description": "Take full control of your WordPress site with Advanced Access Manager (AAM), the ultimate plugin for managing access at the frontend, backend, and API &hellip;",
      "description": "<blockquote>\n<p>Advanced Access Manager (aka AAM) is a powerfully robust WordPress plugin designed to help you control every aspect of your website, your way.</p>\n</blockquote>\n<p><iframe loading=\"lazy\" title=\"Introduction to Advanced Access Manager WordPress Plugin\" width=\"750\" height=\"422\" src=\"https://www.youtube.com/embed/9oU6wjlSRM8?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></p>\n<h4>Key Features</h4>\n<ul>\n<li><strong>Security Audit:</strong> Service that can quickly identified potential broken access controls, compromised accounts and server misconfigurations.</li>\n<li><strong>Unparalleled Flexibility:</strong> The only plugin that offers the freedom to define highly specific access controls across your entire site, with most features available for free.</li>\n<li><strong>Proven Reliability:</strong> Trusted by over 150,000 websites, AAM is rigorously tested and <a href=\"https://aamportal.com/documentation\" rel=\"nofollow ugc\">well-documented</a>, ensuring top-notch quality with minimal support needed.</li>\n<li><strong>Comprehensive Access Management:</strong> Control access for any role, user, or visitor, and configure default permissions for posts, pages, custom post types, categories, and taxonomies.</li>\n<li><strong>Developer-Friendly:</strong> Loaded with hooks and configurations, AAM integrates seamlessly with WordPress core, providing a robust framework for custom development.</li>\n<li><strong>Ad-Free Interface:</strong> Enjoy a clean, well-crafted UI without any advertisements or promotional content.</li>\n<li><strong>Accessible Support:</strong> Get help whenever you need it without being a paid customer. Request support directly from your admin area.</li>\n<li><strong>Transparent Premium Features:</strong> While most features are free, some advanced functionalities require <a href=\"https://aamportal.com/premium\" rel=\"nofollow ugc\">premium add-ons</a>. You&#8217;ll always know when an upgrade is needed.</li>\n</ul>\n<h4>Popular Features</h4>\n<ul>\n<li><strong>Manage Backend Menu:</strong> Control backend menu access for any user or role.</li>\n<li><strong>Roles &amp; Capabilities:</strong> Customize WordPress roles and capabilities with ease.</li>\n<li><strong>Authentication Tools:</strong> Manage JWT authentication seamlessly.</li>\n<li><strong>Temporary User Accounts:</strong> Create and manage temporary user accounts.</li>\n<li><strong>Content Access:</strong> Enjoy granular access controls for posts, pages, and custom content types (premium feature).</li>\n<li><strong>Admin Toolbar Management:</strong> Customize the top admin toolbar for any role or user.</li>\n<li><strong>Backend Lockdown:</strong> Restrict backend access as needed.</li>\n<li><strong>Secure Login Widget:</strong> Use AJAX login widgets or shortcodes anywhere on your site.</li>\n<li><strong>API Management:</strong> Enable/disable RESTful and XML-RPC APIs.</li>\n<li><strong>URI Access Control:</strong> Control access to pages via URLs and set custom redirects (premium feature).</li>\n<li><strong>Endpoint Access:</strong> Manage access to individual RESTful endpoints.</li>\n<li><strong>Passwordless Login:</strong> Allow password-free login via URL.</li>\n<li><strong>Content Filtering:</strong> Use AAM shortcodes to filter or replace content.</li>\n<li><strong>Redirects:</strong> Set custom login, logout, 404, and access denied redirects.</li>\n<li><strong>Metaboxes &amp; Widgets:</strong> Manage metaboxes and widgets visibility.</li>\n<li><strong>IP Address &amp; Domain Access:</strong> Control access based on IP or referred domain (premium feature).</li>\n<li><strong>Multiple Role Support:</strong> Assign multiple roles to users.</li>\n<li><strong>And more&#8230;</strong></li>\n</ul>\n<h4>Security and Privacy</h4>\n<p>AAM is committed to your security and privacy:</p>\n<ul>\n<li>No alterations to your website&#8217;s database.</li>\n<li>No reading of files outside the AAM plugin folder.</li>\n<li>No creation, modification, or deletion of server files or folders.</li>\n<li>No external data capture or transmission about plugin usage or server details.</li>\n<li>No direct integration with other plugins.</li>\n<li>No user session impersonation or swapping; authentication is managed by WordPress core.</li>\n<li>No advertisements or affiliate links.</li>\n</ul>\n<p>Discover the power and flexibility of Advanced Access Manager and take control of your WordPress site today!</p>\n",
      "download_link": "https://downloads.wordpress.org/plugin/advanced-access-manager.6.9.45.zip",
      "tags": {
        "access-control": "access-control",
        "backend-menu": "backend menu",
        "restricted-content": "restricted content",
        "security": "security",
        "user-role": "user role"
      },
      "donate_link": "",
      "icons": {
        "1x": "https://ps.w.org/advanced-access-manager/assets/icon-128x128.png?rev=2982350",
        "2x": "https://ps.w.org/advanced-access-manager/assets/icon-256x256.png?rev=2982350"
      }
    },
    {
      "name": "YM Fast SEO",
      "slug": "ym-fast-seo",
      "version": "3.2.1",
      "author": "<a href=\"https://yanmet.com/\">Yan Metelitsa</a>",
      "author_profile": "https://profiles.wordpress.org/yanmetelitsa/",
      "requires": "6.0",
      "tested": "6.7.1",
      "requires_php": "7.4",
      "requires_plugins": [],
      "rating": 100,
      "ratings": {
        "5": 2,
        "4": 0,
        "3": 0,
        "2": 0,
        "1": 0
      },
      "num_ratings": 2,
      "support_threads": 0,
      "support_threads_resolved": 0,
      "active_installs": 10,
      "downloaded": 760,
      "last_updated": "2025-01-18 11:26pm GMT",
      "added": "2024-09-25",
      "homepage": "",
      "short_description": "Enhance your website with powerful, intuitive, and user-friendly SEO tools.",
      "description": "<p>YM Fast SEO enhances your website with powerful, intuitive, and easy-to-use SEO tools. In today’s digital world, SEO is essential for driving organic traffic and improving your website’s visibility on search engines.</p>\n<p>With YM Fast SEO, you can easily manage important aspects of search optimization without unnecessary complexity. Unlike bulky alternatives, this lightweight plugin is efficient, flexible, and easy to extend, allowing you to keep full control over your website’s performance.</p>\n<h4>Features</h4>\n<ul>\n<li>Lightweight &amp; Extendable</li>\n<li>Posts/Taxonomies Meta Tags Fields</li>\n<li>Automated Open Graph, Twitter Card, and Schema.org Markups</li>\n<li>Quick SEO Analysis + Site SEO Health Page</li>\n<li>Services Integration (Analytics + Webmasters)</li>\n<li>Automatic IndexNow Sending</li>\n<li><code>Robots.txt</code> Editor</li>\n<li>Other Useful Tools &amp; Improvement</li>\n</ul>\n",
      "download_link": "https://downloads.wordpress.org/plugin/ym-fast-seo.3.2.1.zip",
      "tags": {
        "optimization": "optimization",
        "search": "search",
        "seo": "seo"
      },
      "donate_link": "",
      "icons": {
        "1x": "https://ps.w.org/ym-fast-seo/assets/icon.svg?rev=3157442",
        "svg": "https://ps.w.org/ym-fast-seo/assets/icon.svg?rev=3157442"
      }
    }
  ]
}
